Repository: yshialexandra/Optimizing_LLM_Chinese_Translation_through_Syntactic_Feature_Extraction_and_Representation_Editing
Catalog: yshibachlorpaper/Yiyan_tmx/E01B.tmx
Source language: en_us
Languages: zh_cn

source: How to Clean Cork Flooring
zh_cn: 教你清洁软木地板

source: In addition to its being incredibly environmentally friendly, beautiful in appearance and a great sound proofing agent, cork flooring has yet another redeeming attribute - it's also extremely easy to clean.
zh_cn: 软木地板，除了环保功能佳，外观漂亮，隔音效果好，还有另一个可取之处——极其便于清洁。

source: If you've recently purchased cork flooring, you might still be a little unsure as to how to clean them properly without causing damage to your investment. By following these steps, you can prolong the life of your cork flooring while simultaneously enjoying all of its positive qualities.
zh_cn: 如果你最近新买了软木地板，可能还不确定怎样清洁才不会伤害到它，那么按照下面这些步骤来，不仅可延长它的使用寿命，同时还可享受到它所有好品质。

source: Sweep daily.
zh_cn: 每天打扫。

source: A little cleaning here and there eliminates the need for a major cleaning down the road.
zh_cn: 随处的小打扫可以省去日后的大扫除。

source: Remember that cork flooring, for all of its favorable characteristics, can be easily scratched. Use a broom with soft bristles to remove dirt, dust and other debris that builds up on your floor throughout the day.
zh_cn: 记住，软木地板很容易就被刮花，要用软毛的扫帚来清扫每天地板上累积的灰尘和碎屑。

source: Treat messes immediately.
zh_cn: 对泼溅在地板上的脏东西要立即清除。

source: Spills happen in every home.
zh_cn: 谁家都会有泼洒漏溅的情况。

source: Whether you live alone, with roommates, or have a large family under your roof, you're bound to have a few accidents. Whether milk, wine, spaghetti sauce or some other substance, it's important to wipe up messes immediately.
zh_cn: 无论你是独居、与室友同住还是一大家子生活在一起，必定会出现些小状况，不管地板上是洒上了牛奶、葡萄酒、意面酱或是其他什么东西，都要立即清除干净，这点非常重要。

source: If you allow spills to sink into your cork flooring, you could eventually be dealing with unsightly spots and mold growth.
zh_cn: 如果你放任这些泼溅物渗进你的软木地板里，最后怕只得与难看的污点和霉变作斗争了。

source: Mop regularly.
zh_cn: 定期拖地。

source: Like other types of wood flooring, a quick mop is all you need to get your cork floors back to their beautiful, sparkling best.
zh_cn: 跟其他类型的木地板一样，你的软木地板只需一个轻便拖把就可恢复光洁亮丽。

source: However, because cork flooring should never be saturated, use a lightly dampened sponge mop in place of a soaking wet rag mop.
zh_cn: 不过，软木地板永远也别有渗透，所以丢掉湿漉漉的布拖，用一把稍稍潮湿的海绵拖把来清洁。

source: Additionally, only use cleaning solutions approved for cork flooring as other types of cleaner may be too abrasive.
zh_cn: 另外，洗涤剂只能是软木地板上允许使用的，因为其他类型洗涤剂可能具有腐蚀性。

source: Finally, once your cork flooring is cleaned wait until they are completely dry before replacing rugs and furniture.
zh_cn: 最后要说的是，一旦你清洁软木地板以后，就一定要等到它完全干透再更换地毯和家具。

source: If you replace these items before your floor is completely dry, it could cause moisture to become trapped on top of the flooring and ruin the finish.
zh_cn: 不然，水分会滞留在地板表面而损害抛光剂。

source: When it comes to an investment like cork flooring, you likely want to take every step to make sure it lasts.
zh_cn: 像软木地板这样花了大价钱买的东西，你多半会按照以上每个步骤进行清洁，以确保延长它的使用寿命。
